Revit 2027 API
BaseLoadOn Enumeration
 An enumerated type listing all the possible power load use types for a space object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BaseLoadOn
Public Enumeration BaseLoadOn
public enum class BaseLoadOn
type BaseLoadOn
Members
Member name | Value | Description
kBySpaceType | -1 |  Return BaseLoadOn is BySpaceType.
kNoOfBaseLoadOnMethods | 3 |  Return BaseLoadOn is NoOfBaseLoadOnMethods.
kUseActualLoad | 2 |  Return BaseLoadOn is UseActualLoad.
kUseCalculatedLoad | 1 |  Return BaseLoadOn is UseCalculatedLoad.
kUseEnteredLoad | 0 |  Return BaseLoadOn is UseEnteredLoad.
See Also
Reference
Autodesk.Revit.DB Namespace